/*************************************************************************
	> File Name: 1.c
	> Author: 
	> Mail: 
	> Created Time: 2017年12月05日 星期二 23时17分14秒
 ************************************************************************/

#include<stdio.h>
int main()
{
    char buf[1024];
    printf("\033[37m请输入用户名:");
    scanf("%s", buf);
    printf("\033[0m");
    printf("**********************\n");
    printf("**********************\n");


    printf("请输入用户名:");
    printf("\033[37m");
    scanf("%s", buf);
    printf("\033[0m");
    printf("**********************\n");
    printf("**********************\n");
    return 0;
}
